src/cf/InformationRegisters/КомплектацияПодключаемогоОборудования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КомплектацияПодключаемогоОборудования</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ОсновноеОборудование</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПодключаемоеОборудованиеРМК</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДополнительноеОборудование</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПодключаемоеОборудованиеРМК</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/КомплектацияПодключаемогоОборудования/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьТекстЗапросаУстройствРаспознаванияЭлектронныхВесов() Экспорт
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	КомплектацияПодключаемогоОборудования.ОсновноеОборудование КАК ЭлектронныеВесыСсылка,
	|	КомплектацияПодключаемогоОборудования.ДополнительноеОборудование КАК УстройствоРаспознаванияСсылка
	|ИЗ
	|	РегистрСведений.КомплектацияПодключаемогоОборудования КАК КомплектацияПодключаемогоОборудования
	|ГДЕ
	|	КомплектацияПодключаемогоОборудования.ОсновноеОборудование В(&ЭлектронныеВесы)
	|	И КомплектацияПодключаемогоОборудования.ДополнительноеОборудование В(&УстройстваРаспознавания)";
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти

#КонецЕсли
